---
kind: method
id: M:Autodesk.Revit.DB.Structure.AnalyticalSurfaceBase.GetOuterContour
source: html/2f888fc9-ecf5-25d3-ba0e-06351c07609b.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalSurfaceBase.GetOuterContour Method

Returns the Curve Loop that defines the geometry of the Analytical Surface element.

## Syntax (C#)
```csharp
public CurveLoop GetOuterContour()
```

## Returns
CurveLoop associated with Analytical Surface element.